; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v5 - type_3 ?v2 - type_1)
 	      (pred_2 ?v3 - object ?v2 - type_1)
	      (pred_3 ?v5 - type_3 ?v1 - type_2)
	      (pred_1 ?v5 - type_3 ?v3 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v5 - type_3 ?v4 ?v6 - type_1)
       :precondition (and  (pred_4 ?v5 ?v4))
       :effect (and  (pred_4 ?v5 ?v6)
		     (not (pred_4 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_3 ?v7 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v8) (pred_4 ?v5 ?v8) (pred_3 ?v5 ?v1))
       :effect (and (pred_1 ?v5 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v8)) 
		    (not (pred_3 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_3 ?v7 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v7 ?v1) (pred_4 ?v5 ?v8))
       :effect (and (pred_2 ?v7 ?v8)
		    (pred_3 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_08 - type_3
obj_12 obj_06 obj_11 obj_09 - type_2
obj_10 obj_04 obj_05 obj_14 - type_1
obj_03 obj_02 obj_07 obj_13 - object)
(:init
(pred_4 obj_01 obj_10)
(pred_3 obj_01 obj_12)
(pred_3 obj_01 obj_06)
(pred_4 obj_08 obj_04)
(pred_3 obj_08 obj_11)
(pred_3 obj_08 obj_09)
(pred_2 obj_03 obj_10)
(pred_2 obj_02 obj_10)
(pred_2 obj_07 obj_14)
(pred_2 obj_13 obj_10)
)
(:goal
(and
(pred_2 obj_03 obj_04)
(pred_2 obj_02 obj_10)
(pred_2 obj_07 obj_04)
(pred_2 obj_13 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_05)))
)
)

; plan
1. (op_2 obj_01 obj_03 obj_10 obj_06)
   deleted: (pred_2 obj_03 obj_10) (pred_3 obj_01 obj_06)
   added: (pred_1 obj_01 obj_03 obj_06)
   goals met: 1 of 4
2. (op_2 obj_01 obj_13 obj_10 obj_12)
   deleted: (pred_2 obj_13 obj_10) (pred_3 obj_01 obj_12)
   added: (pred_1 obj_01 obj_13 obj_12)
   goals met: 1 of 4
3. (op_1 obj_08 obj_04 obj_14)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_14)
   goals met: 1 of 4
4. (op_1 obj_01 obj_10 obj_04)
   deleted: (pred_4 obj_01 obj_10)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 4
5. (op_2 obj_08 obj_07 obj_14 obj_09)
   deleted: (pred_2 obj_07 obj_14) (pred_3 obj_08 obj_09)
   added: (pred_1 obj_08 obj_07 obj_09)
   goals met: 1 of 4
6. (op_3 obj_01 obj_03 obj_04 obj_06)
   deleted: (pred_1 obj_01 obj_03 obj_06)
   added: (pred_2 obj_03 obj_04) (pred_3 obj_01 obj_06)
   goals met: 2 of 4
7. (op_1 obj_08 obj_14 obj_04)
   deleted: (pred_4 obj_08 obj_14)
   added: (pred_4 obj_08 obj_04)
   goals met: 2 of 4
8. (op_3 obj_01 obj_13 obj_04 obj_12)
   deleted: (pred_1 obj_01 obj_13 obj_12)
   added: (pred_2 obj_13 obj_04) (pred_3 obj_01 obj_12)
   goals met: 2 of 4
9. (op_3 obj_08 obj_07 obj_04 obj_09)
   deleted: (pred_1 obj_08 obj_07 obj_09)
   added: (pred_2 obj_07 obj_04) (pred_3 obj_08 obj_09)
   goals met: 3 of 4
10. (op_2 obj_08 obj_13 obj_04 obj_09)
   deleted: (pred_2 obj_13 obj_04) (pred_3 obj_08 obj_09)
   added: (pred_1 obj_08 obj_13 obj_09)
   goals met: 3 of 4
11. (op_1 obj_08 obj_04 obj_05)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_05)
   goals met: 3 of 4
12. (op_3 obj_08 obj_13 obj_05 obj_09)
   deleted: (pred_1 obj_08 obj_13 obj_09)
   added: (pred_2 obj_13 obj_05) (pred_3 obj_08 obj_09)
   goals met: 4 of 4
